tms/tms_send/test/soap-data.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:xsi="http://www.w3c.org/2001/XML-Schema-Instance" xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" xmlns:hl7ebxml="urn:hl7-org:transport/ebxml/DSTUv1.0" xmlns:xlink="http://www.w3.org/1999/xlink">
<SOAP:Header>
	<eb:MessageHeader SOAP:mustUnderstand="1" eb:version="2.0">
		<eb:From>
			<eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">RHM-801710</eb:PartyId>
		</eb:From>
		<eb:To>
			<eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">SIAB-C-1</eb:PartyId>
		</eb:To>
		<eb:CPAId>S2001924A2012004</eb:CPAId>
		<eb:ConversationId>993C8839-8FC0-11E2-A805-AFEB563F31BA</eb:ConversationId>
		<eb:Service>urn:nhs:names:services:pdsquery</eb:Service>
		<eb:Action>QUPA_IN000006UK02</eb:Action>
		<eb:MessageData>
			<eb:MessageId>993C8839-8FC0-11E2-A805-AFEB563F31BA</eb:MessageId>
			<eb:Timestamp>2013-03-18T11:40:14Z</eb:Timestamp>
		</eb:MessageData>
		
	</eb:MessageHeader>
	
	<eb:SyncReply SOAP:mustUnderstand="1" eb:version="2.0" SOAP:actor="http://schemas.xmlsoap.org/soap/actor/next"/>
</SOAP:Header>
<SOAP:Body>
	<eb:Manifest SOAP:mustUnderstand="1" eb:version="2.0">
		<eb:Reference xlink:href="cid:993c883a-8fc0-11e2-a805-afeb563f31ba@spine.nhs.uk">
			<eb:Schema eb:location="http://www.nhsia.nhs.uk/schemas/HL7-Message.xsd" eb:version="1.0"/>
			<eb:Description xml:lang="en">HL7 payload</eb:Description> 
			<hl7ebxml:Payload style="HL7" encoding="XML" version="3.0"/>
		</eb:Reference>
		
	</eb:Manifest>
</SOAP:Body>
</SOAP:Envelope>